valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
void ILI9341_HandleCalibrationTouch(void)
{
    /* Handle calibration touch events */
    if (pressure_control_page == 8) {
        /* Update ADC reading display */
        static uint32_t last_adc_update = 0;
        uint32_t current_time = HAL_GetTick();
        
        if (current_time - last_adc_update > 200) { /* Update every 200ms for better responsiveness */
            last_adc_update = current_time;
            
            /* KRİTİK DÜZƏLİŞ: ADC oxunması PID sistemindən götürülür - ADC bloklanması yoxdur */
            SystemStatus_t* status = AdvancedPressureControl_GetStatus();
            uint16_t adc_value = status->raw_adc_value;  // Xam ADC dəyəri Status-dan
            
            /* Update display with current ADC value */
            char adc_str[30];
            sprintf(adc_str, "ADC: %d", adc_value);
            ILI9341_DrawString(20, 170, adc_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
            
            /* PID sistemindən təzyiq dəyərini götür */
            float current_pressure = status->current_pressure;
            char pressure_str[30];
            sprintf(pressure_str, "Pressure: %.1f bar", current_pressure);
            ILI9341_DrawString(20, 180, pressure_str, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
            
            /* Show calibration values */
            char debug_cal_str[50];
            sprintf(debug_cal_str, "Cal: %d-%d -> %.1f-%.1f", adc_min, adc_max, min_pressure, max_pressure);
            ILI9341_DrawString(20, 190, debug_cal_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
            /* KRİTİK DÜZƏLİŞ: HAL_ADC_Stop() silindi - artıq manual ADC oxunması yoxdur */
            /* ADC dəyəri Status-dan götürülür, ona görə də Stop() lazım deyil */
        }
    }
}

/* ==================== AUTO MODE CONTROL FUNCTIONS ==================== */

/* AutoMode functions - REMOVED (AutoMode deleted) */

/* ==================== 3-NÖQTƏLİ TOUCH KALİBRASİYA ==================== */

/**
 * @brief Kalibrasiya nişanı (hədəf) çək
 * @param x, y: Nişanın mərkəzi
 * @param color: Nişanın rəngi
 */
void ILI9341_DrawCalibrationTarget(uint16_t x, uint16_t y, uint16_t color)
{
    /* Böyük + işarəsi çək */
    ILI9341_DrawHLine(x - 15, y, 31, color);      /* Horizontal xətt */
    ILI9341_DrawVLine(x, y - 15, 31, color);      /* Vertical xətt */
    
    /* Mərkəzdə kiçik dairə */
    for (int dx = -3; dx <= 3; dx++) {
        for (int dy = -3; dy <= 3; dy++) {
            if (dx*dx + dy*dy <= 9) {
                ILI9341_DrawPixel(x + dx, y + dy, color);
            }
        }
    }
    
    /* Xarici dairə */
    for (int angle = 0; angle < 360; angle += 10) {
        float rad = angle * 3.14159f / 180.0f;
        int px = x + (int)(12.0f * cosf(rad));
        int py = y + (int)(12.0f * sinf(rad));
        ILI9341_DrawPixel(px, py, color);
    }
}

/**
 * @brief 3-nöqtəli touch ekran kalibrasiyası
 * @note Bu funksiya ekran açılmadan əvvəl çağırılmalıdır
 * @return 1 uğurlu, 0 ləğv/xəta
 */
uint8_t ILI9341_RunTouchCalibration(void)
{
    /* Kalibrasiya nöqtələri */
    const uint16_t cal_points_x[3] = {CAL_POINT1_X, CAL_POINT2_X, CAL_POINT3_X};
    const uint16_t cal_points_y[3] = {CAL_POINT1_Y, CAL_POINT2_Y, CAL_POINT3_Y};
    
    printf("=== 3-NÖQTƏLI TOUCH KALİBRASİYA ===\r\n");
    
    /* Ekranı qara et */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    /* Başlıq */
    ILI9341_DrawString(40, 80, "TOUCH CALIBRATION", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawString(30, 110, "Touch anywhere to test", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(50, 130, "Waiting for touch...", ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    
    /* ============================================
     * ÖN-TEST: Touch sensorunun işlədiyini yoxla
     * ============================================ */
    printf("Touch sensor test - waiting for any touch...\r\n");
    
    uint32_t test_timeout = HAL_GetTick() + 10000;  /* 10 saniyə test */
    uint8_t touch_detected = 0;
    uint16_t test_x = 0, test_y = 0;
    
    while (!touch_detected && HAL_GetTick() < test_timeout) {
        if (XPT2046_IsTouched()) {
            HAL_Delay(30);  /* Debounce */
            if (XPT2046_IsTouched()) {
                /* Raw koordinatları oxumağa çalış */
                if (XPT2046_GetCoordinates(&test_x, &test_y)) {
                    touch_detected = 1;
                    printf("Touch detected! Raw: (%d, %d)\r\n", test_x, test_y);
                    
                    /* Uğurlu mesaj göstər */
                    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
                    ILI9341_DrawString(60, 100, "TOUCH DETECTED!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
                    
                    char coord_msg[32];
                    sprintf(coord_msg, "Raw: X=%d Y=%d", test_x, test_y);
                    ILI9341_DrawString(60, 140, coord_msg, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
                    
                    HAL_Delay(1500);
                    
                    /* Touch buraxılmasını gözlə */
                    while (XPT2046_IsTouched()) {
                        HAL_Delay(10);
                    }
                    HAL_Delay(300);
                } else {
                    printf("Touch IRQ active but no valid coordinates!\r\n");
                }
            }
        }
        HAL_Delay(50);
    }
    
    if (!touch_detected) {
        printf("ERROR: Touch sensor not responding!\r\n");
        printf("Check hardware connections:\r\n");
        printf("  T_CS   -> PB12\r\n");
        printf("  T_CLK  -> PA5\r\n");
        printf("  T_DO   -> PA6\r\n");
        printf("  T_DIN  -> PB5\r\n");
        printf("  T_IRQ  -> PF10\r\n");
        
        ILI9341_FillScreen(ILI9341_COLOR_BLACK);
        ILI9341_DrawString(40, 80, "TOUCH ERROR!", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 2);
        ILI9341_DrawString(20, 120, "Sensor not responding", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
        ILI9341_DrawString(20, 150, "Using default calibration", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 1);
        
        /* Default kalibrasiya dəyərləri yüklə */
        XPT2046_LoadDefaultCalibration();
        
        HAL_Delay(3000);
        
