valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
        return 0;
    }
    
    /* ============================================
     * 3-NÖQTƏLİ KALİBRASİYA
     * ============================================ */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    ILI9341_DrawString(40, 100, "CALIBRATION START", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawString(50, 130, "Touch the 3 points", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    
    HAL_Delay(1500);
    
    /* Hər nöqtə üçün */
    for (int point = 0; point < 3; point++) {
        /* Ekranı təmizlə */
        ILI9341_FillScreen(ILI9341_COLOR_BLACK);
        
        /* Cari nöqtə nömrəsini göstər */
        char msg[30];
        sprintf(msg, "Touch point %d of 3", point + 1);
        ILI9341_DrawString(80, 200, msg, ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 1);
        
        /* Kalibrasiya hədəfini çək */
        ILI9341_DrawCalibrationTarget(cal_points_x[point], cal_points_y[point], ILI9341_COLOR_RED);
        
        printf("Waiting for touch at point %d (%d, %d)...\r\n", 
               point + 1, cal_points_x[point], cal_points_y[point]);
        
        /* Touch gözlə */
        uint16_t raw_x = 0, raw_y = 0;
        uint8_t touched = 0;
        uint32_t timeout = HAL_GetTick() + 30000;  /* 30 saniyə timeout */
        
        /* Əvvəlcə touch buraxılmasını gözlə */
        uint32_t release_timeout = HAL_GetTick() + 2000;
        while (XPT2046_IsTouched() && HAL_GetTick() < release_timeout) {
            HAL_Delay(10);
        }
        HAL_Delay(200);  /* Debounce */
        
        /* İndi yeni touch gözlə */
        while (!touched && HAL_GetTick() < timeout) {
            if (XPT2046_IsTouched()) {
                HAL_Delay(50);  /* Stabil touch üçün gözlə */
                
                if (XPT2046_IsTouched()) {
                    /* Raw koordinatları oxu */
                    if (XPT2046_GetCoordinates(&raw_x, &raw_y)) {
                        touched = 1;
                        
                        /* Kalibrasiya nöqtəsini qeyd et */
                        XPT2046_SetCalibrationPoint(point, raw_x, raw_y);
                        
                        /* Yaşıl nişan çək - uğurlu */
                        ILI9341_DrawCalibrationTarget(cal_points_x[point], cal_points_y[point], 
                                                      ILI9341_COLOR_GREEN);
                        
                        printf("Point %d captured: raw(%d, %d)\r\n", point + 1, raw_x, raw_y);
                    }
                }
            }
            HAL_Delay(10);
        }
        
        if (!touched) {
            /* Timeout - kalibrasiya ləğv edildi */
            printf("Calibration timeout at point %d\r\n", point + 1);
            ILI9341_FillScreen(ILI9341_COLOR_BLACK);
            ILI9341_DrawString(80, 110, "CALIBRATION", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 2);
            ILI9341_DrawString(80, 140, "TIMEOUT!", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 2);
            HAL_Delay(2000);
            return 0;
        }
        
        /* Touch buraxılmasını gözlə */
        while (XPT2046_IsTouched()) {
            HAL_Delay(10);
        }
        HAL_Delay(300);  /* Növbəti nöqtə üçün gözlə */
    }
    
    /* Kalibrasiya hesabla */
    XPT2046_FinishCalibration();
    
    /* Uğurlu mesaj */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    ILI9341_DrawString(60, 100, "CALIBRATION", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawString(70, 130, "COMPLETE!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
    
    /* Kalibrasiya dəyərlərini göstər */
    TouchCalibration_t* cal = XPT2046_GetCalibrationData();
    char info[40];
    sprintf(info, "a=%.3f b=%.3f", cal->a, cal->b);
    ILI9341_DrawString(30, 170, info, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    sprintf(info, "d=%.3f e=%.3f", cal->d, cal->e);
    ILI9341_DrawString(30, 190, info, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    
    HAL_Delay(2000);  /* 2 saniyə göstər */
    
    printf("=== KALİBRASİYA TAMAMLANDI ===\r\n");
    return 1;
}
